<table align="center" width=100%>
    <tr>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>PDS Mini Project 2 <br>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

##### Add comments and inferences about the solutions.

### 1. Create a dataframe named 'europe_df' which has names of countries in europe, their capital and their population. (2 marks)

europe_dict = {
       "Country":["Spain","France","Germany","Norway"],
       "Capital":["Madrid","Paris","Berlin","Oslo"],
       "Population":[46.77,66.03,80.62,5.084]
}

In [1]:
import pandas as pd
import numpy as np

In [34]:
europe_dict = { "Country":["Spain","France","Germany","Norway"],
                "Capital":["Madrid","Paris","Berlin","Oslo"],
                "Population":[46.77,66.03,80.62,5.084]}

europe_df=pd.DataFrame(europe_dict)
europe_df

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

### 2. Use the data from question 1 and add a new column 'FamousFor'. The column should indicate what each country is famous for. (2 marks)

In [35]:
county_famous=['Food','EiffelTower','Art & Culture','Landscape']
county_famous

['Food', 'EiffelTower', 'Art & Culture', 'Landscape']

In [36]:
#europe_df['abc']=county_famous

#DataFrameName.insert(loc, column_name, value, allow_duplicates = False)
europe_df.insert(3,'FamousFor',county_famous)
europe_df

   Country Capital  Population      FamousFor
0    Spain  Madrid      46.770           Food
1   France   Paris      66.030    EiffelTower
2  Germany  Berlin      80.620  Art & Culture
3   Norway    Oslo       5.084      Landscape

**Note:** Assigning a column that doesnâ€™t exist will create a new column.

### 3. Use the data created in question 1, to do the following: (3 marks)
#### Access column 'Captial' by specifying the column number.
#### Access column 'Population' by specifying the column name.
#### Access a country information

In [37]:
# 1. Access column 'Captial' by specifying the column number.

europe_df.iloc[ : ,1]

0    Madrid
1     Paris
2    Berlin
3      Oslo
Name: Capital, dtype: object

In [38]:
# 2. Access column 'Population' by specifying the column name.

europe_df['Population']

0    46.770
1    66.030
2    80.620
3     5.084
Name: Population, dtype: float64

In [39]:
# 3. Access a country information
# Lets say we want access information for France

europe_df[europe_df['Country']=='France']

  Country Capital  Population    FamousFor
1  France   Paris       66.03  EiffelTower

	
### 4. Read a csv file "example.csv", print it and also check its dimensions ( 2marks)

In [40]:
# import the data set

data=pd.read_csv("example.csv")
data

  Product ID  Cost Price  Selling Price
0       45SD          60            135
1       12PO          43            121
2       54PL          78            150
3       26PL          65            121
4       68HG          50            132
5       21ER         150            152
6       10FG         132            165
7       57HB         134            161
8       75VB         109            124
9      32HJH         121            152

In [41]:
# check dimension/shape of the dataframe

print("Dimension of dataset is ", data.shape)

Dimension of dataset is  (10, 3)

### INFERENCE: <font color='orange'> Using the shape attribute, we can see the dimension of the dataset and our data has 10 rows and  3 columns.</font>

### 5. Create a new column BMI, calculate the BMI of persons based on their weight and height. ( 2marks)

In [42]:
df_hw=pd.DataFrame({"Weight 'kg'":[56,62,75,80,78,70,67,54,78,59],
                    "Height 'm'":[1.57,1.61,1.70,1.79,1.69,1.76,1.64,1.79,1.64,1.55]})
df_hw

   Weight 'kg'  Height 'm'
0           56        1.57
1           62        1.61
2           75        1.70
3           80        1.79
4           78        1.69
5           70        1.76
6           67        1.64
7           54        1.79
8           78        1.64
9           59        1.55

In [43]:
# Let us create a new column 'BMI'
# BMI formula = weight/height**2

df_hw['BMI']= df_hw["Weight \'kg\'"] / df_hw["Height \'m\'"]**2
df_hw

   Weight 'kg'  Height 'm'        BMI
0           56        1.57  22.718974
1           62        1.61  23.918830
2           75        1.70  25.951557
3           80        1.79  24.968010
4           78        1.69  27.309968
5           70        1.76  22.598140
6           67        1.64  24.910767
7           54        1.79  16.853407
8           78        1.64  29.000595
9           59        1.55  24.557752

### 6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e (2 marks)

In [44]:
series_num=pd.Series(data=[4,7,-5,3,np.nan],index=['d','b','a','c','e'])
series_num

d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

### 7. Using the series in question 6, find:                       (2 marks)
#### Find the minimum of all values
#### Find the maximum of all value

In [45]:
# the minimum of all values

print("Minimum of all values is ", series_num.min())

Minimum of all values is  -5.0

In [46]:
# the maximum of all value

print("Maximum of all values is ", series_num.max())

Maximum of all values is  7.0

### 8. Using the series in question 6, sort: ( 2 marks)
#### the values in ascending order
#### the values in decending order

In [47]:
# sorting the values in ascending order

series_num.sort_values(ascending=True,na_position='first')

e    NaN
a   -5.0
c    3.0
d    4.0
b    7.0
dtype: float64

In [48]:
# sorting the values in descending order

series_num.sort_values(ascending=False,na_position='last')

b    7.0
d    4.0
c    3.0
a   -5.0
e    NaN
dtype: float64

### INFERENCE: <font color='orange'> Irrespective of sorting order,'NaN'values are always at the end unless we manipulate their postion by using 'na_position'.</font>

### 9. Find duplicate rows based on selected column ('Name') ( 2 marks)

**Use the data frame given below:**
 

<table>
<tr>
<th>Name</th>
<th>Salary</th>
<th>City</th>
</tr>
<tr>
<td>John</td>
<td>3400</td>
<td>Sydeny</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Aadi</td>
<td>1600</td>
<td>New York</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Texas</td>
</tr>
<tr>
<td>Aadi</td>
<td>4000</td>
<td>London</td>
</tr>
<tr>
<td>Sachin</td>
<td>3000</td>
<td>Chicago</td>
</tr>
</table>

In [49]:
hf=pd.read_html('Data1.htm')
hf[0] 
#since output is a list we have fetched first element.

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
3  Robert    3000   Chicago
4  Robert    3000   Chicago
5  Robert    3000     Texas
6    Aadi    4000    London
7  Sachin    3000   Chicago

In [50]:
type(hf[0])
# hf[0] is already a dataframe

pandas.core.frame.DataFrame

In [51]:
df_h=hf[0]
df_h

     Name  Salary      City
0    John    3400    Sydeny
1  Robert    3000   Chicago
2    Aadi    1600  New York
3  Robert    3000   Chicago
4  Robert    3000   Chicago
5  Robert    3000     Texas
6    Aadi    4000    London
7  Sachin    3000   Chicago

In [52]:
print("Duplicated rows based on 'Name' column are: ")
df_h[df_h['Name'].duplicated()]

Duplicated rows based on 'Name' column are:

     Name  Salary     City
3  Robert    3000  Chicago
4  Robert    3000  Chicago
5  Robert    3000    Texas
6    Aadi    4000   London

### INFERENCE: <font color='orange'> Duplicated rows based on 'Name' column are shown above. Name='Robert' is initially  present at 1st index and then found again at 3rd, 4th and 5th index positions.Similarly, Name='Aadi' is present at 2nd & 6th index positions.</font>

### 10. Get the descriptive statistics of the sales for each season ( 2marks)

**Use the data frame given below:**
   
<table>
<tr>
<th>Month</th>
<th>Sales</th>
<th>Seasons</th>
</tr>
<tr>
<td>Jan</td>
<td>22000</td>
<td>Winter</td>
</tr>
<tr>
<td>Feb</td>
<td>27000</td>
<td>Winter</td>
</tr>
<tr>
<td>Mar</td>
<td>25000</td>
<td>Spring</td>
</tr>
<tr>
<td>Apr</td>
<td>29000</td>
<td>Spring</td>
</tr>
<tr>
<td>May</td>
<td>35000</td>
<td>Spring</td>
</tr>
<tr>
<td>June</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>July</td>
<td>78000</td>
<td>Summer</td>
</tr>
<tr>
<td>Aug</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>Sep</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Oct</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Nov</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Dec</td>
<td>60000</td>
<td>Winter</td>
</tr>

</table>

In [2]:
#To read it as html file. Save it in a txt document with .htm extension. Add '<!DOCTYPE html> & </html>'

In [53]:
sales_data= [['Jan',22000,'Winter'],['Feb',27000,'Winter'],['Mar',25000,'Spring'],['Apr',29000,'Spring'],
             ['May',35000,'Spring'],['June',67000,'Summer'],['July',78000,'Summer'],['Aug',67000,'Summer'],
             ['Sep',56000,'Fall'],  ['Oct',56000,'Fall'],   ['Nov',56000,'Fall'],  ['Dec',60000,'Winter']]

df_sales=pd.DataFrame(sales_data,columns=['Month','Sales','Seasons'])
df_sales

   Month  Sales Seasons
0    Jan  22000  Winter
1    Feb  27000  Winter
2    Mar  25000  Spring
3    Apr  29000  Spring
4    May  35000  Spring
5   June  67000  Summer
6   July  78000  Summer
7    Aug  67000  Summer
8    Sep  56000    Fall
9    Oct  56000    Fall
10   Nov  56000    Fall
11   Dec  60000  Winter

In [54]:
#df_name.groupby('col_to_be_grped')['col_to_be_descb'].describe()

df_sales.groupby('Seasons')['Sales'].describe()

,count,mean,std,min,25%,50%,75%,max
Seasons,,,,,,,,
Fall,3.0,56000.000000,0.000000,56000.0,56000.0,56000.0,56000.0,56000.0
Spring,3.0,29666.666667,5033.222957,25000.0,27000.0,29000.0,32000.0,35000.0
Summer,3.0,70666.666667,6350.852961,67000.0,67000.0,67000.0,72500.0,78000.0
Winter,3.0,36333.333333,20647.840888,22000.0,24500.0,27000.0,43500.0,60000.0

### 11. Combine the new column age in the below data frame (2 marks)

**Use the data frame given below:**
   
<table>
<tr>
<th>Name</th>
<th>Maths</th>
<th>Science</th>
<th>English</th>
</tr>
<tr>
<td>Emma</td>
<td>56</td>
<td>89</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>78</td>
<td>87</td>
<td>89</td>
</tr>
<tr>
<td>Sophia</td>
<td>78</td>
<td>78</td>
<td>76</td>
</tr>
<tr>
<td>James</td>
<td>67</td>
<td>89</td>
<td>78</td>
</tr>
<tr>
<td>John</td>
<td>88</td>
<td>78</td>
<td>87</td>
</tr>
   
</table>

In [3]:
subjects="""
<table>
<tr>
<th>Name</th>
<th>Maths</th>
<th>Science</th>
<th>English</th>
</tr>
<tr>
<td>Emma</td>
<td>56</td>
<td>89</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>78</td>
<td>87</td>
<td>89</td>
</tr>
<tr>
<td>Sophia</td>
<td>78</td>
<td>78</td>
<td>76</td>
</tr>
<tr>
<td>James</td>
<td>67</td>
<td>89</td>
<td>78</td>
</tr>
<tr>
<td>John</td>
<td>88</td>
<td>78</td>
<td>87</td>
</tr>   
</table>
"""

In [4]:
h1=pd.read_html(subjects)
h1

[     Name  Maths  Science  English
 0    Emma     56       89       89
 1     Mia     78       87       89
 2  Sophia     78       78       76
 3   James     67       89       78
 4    John     88       78       87]

In [5]:
df_subjects=h1[0]
df_subjects

     Name  Maths  Science  English
0    Emma     56       89       89
1     Mia     78       87       89
2  Sophia     78       78       76
3   James     67       89       78
4    John     88       78       87

In [58]:
# Let us create a new column 'Age' at index 1

df_subjects.insert(1,'Age',[6,6,7,7,7])
df_subjects

     Name  Age  Maths  Science  English
0    Emma    6     56       89       89
1     Mia    6     78       87       89
2  Sophia    7     78       78       76
3   James    7     67       89       78
4    John    7     88       78       87

### INFERENCE:  <font color='orange'> We have created a new column 'Age' for given dataframe and inserted at index 1 .</font>

### 12.Concatenate two data frames along with the columns

**Use the data frame given below:**
   
<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Alex</td>
<td>Maths</td>
</tr>
<tr>
<td>102</td>
<td>Amy</td>
<td>English</td>
</tr>
<tr>
<td>103</td>
<td>Allen</td>
<td>Science</td>
</tr>
<tr>
<td>104</td>
<td>Alice</td>
<td>German</td>
</tr>
<td>105</td>
<td>Ayoung</td>
<td>History</td>
</tr>
   
</table><br>



<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Billy</td>
<td>English</td>
</tr>
<tr>
<td>102</td>
<td>Brian</td>
<td>Science</td>
</tr>
<tr>
<td>103</td>
<td>Bran</td>
<td>Social Science</td>
</tr>
<tr>
<td>104</td>
<td>Bryce</td>
<td>German</td>
</tr>
<td>105</td>
<td>Betty</td>
<td>History</td>
</tr>
   
</table>

In [59]:
# Dataframe_A

A=[[101,'Alex','Maths'],[102,'Amy','English'],[103,'Allen','Science'],[104,'Alice','German'],[105,'Ayoung','History']]
df_A=pd.DataFrame(A,columns=['ID','Name','Subject'])
df_A

    ID    Name  Subject
0  101    Alex    Maths
1  102     Amy  English
2  103   Allen  Science
3  104   Alice   German
4  105  Ayoung  History

In [60]:
# Dataframe_B

B=[[101,'Billy','English'],[102,'Brian','Science'],[103,'Bran','Science'],[104,'Bryce','German'],[105,'Betty','History']]
df_B=pd.DataFrame(B,columns=['ID','Name','Subject'])
df_B

    ID   Name  Subject
0  101  Billy  English
1  102  Brian  Science
2  103   Bran  Science
3  104  Bryce   German
4  105  Betty  History

In [61]:
df_concatenated=pd.concat([df_A,df_B],ignore_index=True)
df_concatenated

    ID    Name  Subject
0  101    Alex    Maths
1  102     Amy  English
2  103   Allen  Science
3  104   Alice   German
4  105  Ayoung  History
5  101   Billy  English
6  102   Brian  Science
7  103    Bran  Science
8  104   Bryce   German
9  105   Betty  History

### INFERENCE:  <font color='orange'> By default, the 2 dataframes are concatenated along axis=0.</font>